/* automatically generated by rust-bindgen 0.71.1 */

#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {

pub const IRQn_Type_ADC1_COMP_IRQn: IRQn_Type = 12;
#[doc = "< LPTIM1 Interrupt"]
pub const IRQn_Type_LPTIM1_IRQn: IRQn_Type = 13;
#[doc = "< USART4 and USART5 Interrupt"]
pub const IRQn_Type_USART4_5_IRQn: IRQn_Type = 14;
#[doc = "< TIM2 Interrupt"]
pub const IRQn_Type_TIM2_IRQn: IRQn_Type = 15;
#[doc = "< TIM3 Interrupt"]
pub const IRQn_Type_TIM3_IRQn: IRQn_Type = 16;
#[doc = "< TIM6 and DAC Interrupts"]
pub const IRQn_Type_TIM6_DAC_IRQn: IRQn_Type = 17;
#[doc = "< TIM7 Interrupt"]
pub const IRQn_Type_TIM7_IRQn: IRQn_Type = 18;
#[doc = "< TIM21 Interrupt"]
pub const IRQn_Type_TIM21_IRQn: IRQn_Type = 20;
#[doc = "< I2C3 Interrupt"]
pub const IRQn_Type_I2C3_IRQn: IRQn_Type = 21;
#[doc = "< TIM22 Interrupt"]
pub const IRQn_Type_TIM22_IRQn: IRQn_Type = 22;
#[doc = "< I2C1 Interrupt"]
pub const IRQn_Type_I2C1_IRQn: IRQn_Type = 23;
#[doc = "< I2C2 Interrupt"]
pub const IRQn_Type_I2C2_IRQn: IRQn_Type = 24;
#[doc = "< SPI1 Interrupt"]
pub const IRQn_Type_SPI1_IRQn: IRQn_Type = 25;
#[doc = "< SPI2 Interrupt"]
pub const IRQn_Type_SPI2_IRQn: IRQn_Type = 26;
#[doc = "< USART1 Interrupt"]
pub const IRQn_Type_USART1_IRQn: IRQn_Type = 27;
#[doc = "< USART2 Interrupt"]
pub const IRQn_Type_USART2_IRQn: IRQn_Type = 28;
#[doc = "< RNG and LPUART1 Interrupts"]
pub const IRQn_Type_RNG_LPUART1_IRQn: IRQn_Type = 29;
#[doc = "< USB global Interrupt"]
pub const IRQn_Type_USB_IRQn: IRQn_Type = 31;
pub type IRQn_Type = ::core::ffi::c_int;
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::core::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::core::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::core::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __suseconds64_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT32"][::core::mem::size_of::<T_UINT32>() - 4usize];
    ["Alignment of T_UINT32"][::core::mem::align_of::<T_UINT32>() - 1usize];
    ["Offset of field: T_UINT32::v"][::core::mem::offset_of!(T_UINT32, v) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT16_WRITE {
    pub v: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT16_WRITE"][::core::mem::size_of::<T_UINT16_WRITE>() - 2usize];
    ["Alignment of T_UINT16_WRITE"][::core::mem::align_of::<T_UINT16_WRITE>() - 1usize];
    ["Offset of field: T_UINT16_WRITE::v"][::core::mem::offset_of!(T_UINT16_WRITE, v) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT16_READ {
    pub v: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT16_READ"][::core::mem::size_of::<T_UINT16_READ>() - 2usize];
    ["Alignment of T_UINT16_READ"][::core::mem::align_of::<T_UINT16_READ>() - 1usize];
    ["Offset of field: T_UINT16_READ::v"][::core::mem::offset_of!(T_UINT16_READ, v) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32_WRITE {
    pub v: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT32_WRITE"][::core::mem::size_of::<T_UINT32_WRITE>() - 4usize];
    ["Alignment of T_UINT32_WRITE"][::core::mem::align_of::<T_UINT32_WRITE>() - 1usize];
    ["Offset of field: T_UINT32_WRITE::v"][::core::mem::offset_of!(T_UINT32_WRITE, v) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct T_UINT32_READ {
    pub v: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT32_READ"][::core::mem::size_of::<T_UINT32_READ>() - 4usize];
    ["Alignment of T_UINT32_READ"][::core::mem::align_of::<T_UINT32_READ>() - 1usize];
    ["Offset of field: T_UINT32_READ::v"][::core::mem::offset_of!(T_UINT32_READ, v) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    pub b: APSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of APSR_Type__bindgen_ty_1"][::core::mem::size_of::<APSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of APSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<APSR_Type__bindgen_ty_1>() - 4usize];
};
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn V_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_V_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn C_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_C_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Z_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Z_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn N_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_N_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 28u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of APSR_Type"][::core::mem::size_of::<APSR_Type>() - 4usize];
    ["Alignment of APSR_Type"][::core::mem::align_of::<APSR_Type>() - 4usize];
    ["Offset of field: APSR_Type::b"][::core::mem::offset_of!(APSR_Type, b) - 0usize];
    ["Offset of field: APSR_Type::w"][::core::mem::offset_of!(APSR_Type, w) - 0usize];
};
impl Default for APSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    pub b: IPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IPSR_Type__bindgen_ty_1"][::core::mem::size_of::<IPSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of IPSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<IPSR_Type__bindgen_ty_1>() - 4usize];
};
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ISR_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ISR_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                23u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                23u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IPSR_Type"][::core::mem::size_of::<IPSR_Type>() - 4usize];
    ["Alignment of IPSR_Type"][::core::mem::align_of::<IPSR_Type>() - 4usize];
    ["Offset of field: IPSR_Type::b"][::core::mem::offset_of!(IPSR_Type, b) - 0usize];
    ["Offset of field: IPSR_Type::w"][::core::mem::offset_of!(IPSR_Type, w) - 0usize];
};
impl Default for IPSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    pub b: xPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xPSR_Type__bindgen_ty_1"][::core::mem::size_of::<xPSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of xPSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<xPSR_Type__bindgen_ty_1>() - 4usize];
};
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ISR_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ISR_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                15u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                15u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn T_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_T_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved1_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                3u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved1_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn V_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_V_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn C_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_C_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Z_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Z_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn N_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_N_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        T: u32,
        _reserved1: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 15u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 3u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xPSR_Type"][::core::mem::size_of::<xPSR_Type>() - 4usize];
    ["Alignment of xPSR_Type"][::core::mem::align_of::<xPSR_Type>() - 4usize];
    ["Offset of field: xPSR_Type::b"][::core::mem::offset_of!(xPSR_Type, b) - 0usize];
    ["Offset of field: xPSR_Type::w"][::core::mem::offset_of!(xPSR_Type, w) - 0usize];
};
impl Default for xPSR_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    pub b: CONTROL_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CONTROL_Type__bindgen_ty_1"]
        [::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of CONTROL_Type__bindgen_ty_1"]
        [::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>() - 4usize];
};
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nPRIV_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nPRIV_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SPSEL_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SPSEL_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved1_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                30u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved1_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                30u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        _reserved1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::core::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CONTROL_Type"][::core::mem::size_of::<CONTROL_Type>() - 4usize];
    ["Alignment of CONTROL_Type"][::core::mem::align_of::<CONTROL_Type>() - 4usize];
    ["Offset of field: CONTROL_Type::b"][::core::mem::offset_of!(CONTROL_Type, b) - 0usize];
    ["Offset of field: CONTROL_Type::w"][::core::mem::offset_of!(CONTROL_Type, w) - 0usize];
};
impl Default for CONTROL_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVIC_Type {
    pub ISER: [u32; 1usize],
    pub RESERVED0: [u32; 31usize],
    pub ICER: [u32; 1usize],
    pub RSERVED1: [u32; 31usize],
    pub ISPR: [u32; 1usize],
    pub RESERVED2: [u32; 31usize],
    pub ICPR: [u32; 1usize],
    pub RESERVED3: [u32; 31usize],
    pub RESERVED4: [u32; 64usize],
    pub IP: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NVIC_Type"][::core::mem::size_of::<NVIC_Type>() - 800usize];
    ["Alignment of NVIC_Type"][::core::mem::align_of::<NVIC_Type>() - 4usize];
    ["Offset of field: NVIC_Type::ISER"][::core::mem::offset_of!(NVIC_Type, ISER) - 0usize];
    ["Offset of field: NVIC_Type::RESERVED0"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED0) - 4usize];
    ["Offset of field: NVIC_Type::ICER"][::core::mem::offset_of!(NVIC_Type, ICER) - 128usize];
    ["Offset of field: NVIC_Type::RSERVED1"]
        [::core::mem::offset_of!(NVIC_Type, RSERVED1) - 132usize];
    ["Offset of field: NVIC_Type::ISPR"][::core::mem::offset_of!(NVIC_Type, ISPR) - 256usize];
    ["Offset of field: NVIC_Type::RESERVED2"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED2) - 260usize];
    ["Offset of field: NVIC_Type::ICPR"][::core::mem::offset_of!(NVIC_Type, ICPR) - 384usize];
    ["Offset of field: NVIC_Type::RESERVED3"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED3) - 388usize];
    ["Offset of field: NVIC_Type::RESERVED4"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED4) - 512usize];
    ["Offset of field: NVIC_Type::IP"][::core::mem::offset_of!(NVIC_Type, IP) - 768usize];
};
impl Default for NVIC_Type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCB_Type {
    pub CPUID: u32,
    pub ICSR: u32,
    pub VTOR: u32,
    pub AIRCR: u32,
    pub SCR: u32,
    pub CCR: u32,
    pub RESERVED1: u32,
    pub SHP: [u32; 2usize],
    pub SHCSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCB_Type"][::core::mem::size_of::<SCB_Type>() - 40usize];
    ["Alignment of SCB_Type"][::core::mem::align_of::<SCB_Type>() - 4usize];
    ["Offset of field: SCB_Type::CPUID"][::core::mem::offset_of!(SCB_Type, CPUID) - 0usize];
    ["Offset of field: SCB_Type::ICSR"][::core::mem::offset_of!(SCB_Type, ICSR) - 4usize];
    ["Offset of field: SCB_Type::VTOR"][::core::mem::offset_of!(SCB_Type, VTOR) - 8usize];
    ["Offset of field: SCB_Type::AIRCR"][::core::mem::offset_of!(SCB_Type, AIRCR) - 12usize];
    ["Offset of field: SCB_Type::SCR"][::core::mem::offset_of!(SCB_Type, SCR) - 16usize];
    ["Offset of field: SCB_Type::CCR"][::core::mem::offset_of!(SCB_Type, CCR) - 20usize];
    ["Offset of field: SCB_Type::RESERVED1"]
        [::core::mem::offset_of!(SCB_Type, RESERVED1) - 24usize];
    ["Offset of field: SCB_Type::SHP"][::core::mem::offset_of!(SCB_Type, SHP) - 28usize];
    ["Offset of field: SCB_Type::SHCSR"][::core::mem::offset_of!(SCB_Type, SHCSR) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SysTick_Type {
    pub CTRL: u32,
    pub LOAD: u32,
    pub VAL: u32,
    pub CALIB: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SysTick_Type"][::core::mem::size_of::<SysTick_Type>() - 16usize];
    ["Alignment of SysTick_Type"][::core::mem::align_of::<SysTick_Type>() - 4usize];
    ["Offset of field: SysTick_Type::CTRL"][::core::mem::offset_of!(SysTick_Type, CTRL) - 0usize];
    ["Offset of field: SysTick_Type::LOAD"][::core::mem::offset_of!(SysTick_Type, LOAD) - 4usize];
    ["Offset of field: SysTick_Type::VAL"][::core::mem::offset_of!(SysTick_Type, VAL) - 8usize];
    ["Offset of field: SysTick_Type::CALIB"]
        [::core::mem::offset_of!(SysTick_Type, CALIB) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MPU_Type {
    pub TYPE: u32,
    pub CTRL: u32,
    pub RNR: u32,
    pub RBAR: u32,
    pub RASR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MPU_Type"][::core::mem::size_of::<MPU_Type>() - 20usize];
    ["Alignment of MPU_Type"][::core::mem::align_of::<MPU_Type>() - 4usize];
    ["Offset of field: MPU_Type::TYPE"][::core::mem::offset_of!(MPU_Type, TYPE) - 0usize];
    ["Offset of field: MPU_Type::CTRL"][::core::mem::offset_of!(MPU_Type, CTRL) - 4usize];
    ["Offset of field: MPU_Type::RNR"][::core::mem::offset_of!(MPU_Type, RNR) - 8usize];
    ["Offset of field: MPU_Type::RBAR"][::core::mem::offset_of!(MPU_Type, RBAR) - 12usize];
    ["Offset of field: MPU_Type::RASR"][::core::mem::offset_of!(MPU_Type, RASR) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ARM_MPU_Region_t {
    pub RBAR: u32,
    pub RASR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ARM_MPU_Region_t"][::core::mem::size_of::<ARM_MPU_Region_t>() - 8usize];
    ["Alignment of ARM_MPU_Region_t"][::core::mem::align_of::<ARM_MPU_Region_t>() - 4usize];
    ["Offset of field: ARM_MPU_Region_t::RBAR"]
        [::core::mem::offset_of!(ARM_MPU_Region_t, RBAR) - 0usize];
    ["Offset of field: ARM_MPU_Region_t::RASR"]
        [::core::mem::offset_of!(ARM_MPU_Region_t, RASR) - 4usize];
};
unsafe extern "C" {
    #[doc = "< System Clock Frequency (Core Clock)"]
    pub static mut SystemCoreClock: u32;
}
unsafe extern "C" {
    #[doc = "< AHB prescalers table values"]
    pub static AHBPrescTable: [u8; 16usize];
}
unsafe extern "C" {
    #[doc = "< APB prescalers table values"]
    pub static APBPrescTable: [u8; 8usize];
}
unsafe extern "C" {
    #[doc = "< PLL multipiers table values"]
    pub static PLLMulTable: [u8; 9usize];
}
unsafe extern "C" {
    #[doc = " @addtogroup STM32L0xx_System_Exported_Functions\n @{"]
    pub fn SystemInit();
}
unsafe extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[doc = " @brief Analog to Digital Converter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ADC_TypeDef {
    #[doc = "< ADC Interrupt and Status register,                          Address offset:0x00"]
    pub ISR: u32,
    #[doc = "< ADC Interrupt Enable register,                              Address offset:0x04"]
    pub IER: u32,
    #[doc = "< ADC Control register,                                       Address offset:0x08"]
    pub CR: u32,
    #[doc = "< ADC Configuration register 1,                               Address offset:0x0C"]
    pub CFGR1: u32,
    #[doc = "< ADC Configuration register 2,                               Address offset:0x10"]
    pub CFGR2: u32,
    #[doc = "< ADC Sampling time register,                                 Address offset:0x14"]
    pub SMPR: u32,
    #[doc = "< Reserved,                                                                  0x18"]
    pub RESERVED1: u32,
    #[doc = "< Reserved,                                                                  0x1C"]
    pub RESERVED2: u32,
    #[doc = "< ADC watchdog threshold register,                            Address offset:0x20"]
    pub TR: u32,
    #[doc = "< Reserved,                                                                  0x24"]
    pub RESERVED3: u32,
    #[doc = "< ADC channel selection register,                             Address offset:0x28"]
    pub CHSELR: u32,
    #[doc = "< Reserved,                                                                  0x2C"]
    pub RESERVED4: [u32; 5usize],
    #[doc = "< ADC data register,                                          Address offset:0x40"]
    pub DR: u32,
    #[doc = "< Reserved,                                                           0x44 - 0xB0"]
    pub RESERVED5: [u32; 28usize],
    #[doc = "< ADC data register,                                          Address offset:0xB4"]
    pub CALFACT: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ADC_TypeDef"][::core::mem::size_of::<ADC_TypeDef>() - 184usize];
    ["Alignment of ADC_TypeDef"][::core::mem::align_of::<ADC_TypeDef>() - 4usize];
    ["Offset of field: ADC_TypeDef::ISR"][::core::mem::offset_of!(ADC_TypeDef, ISR) - 0usize];
    ["Offset of field: ADC_TypeDef::IER"][::core::mem::offset_of!(ADC_TypeDef, IER) - 4usize];
    ["Offset of field: ADC_TypeDef::CR"][::core::mem::offset_of!(ADC_TypeDef, CR) - 8usize];
    ["Offset of field: ADC_TypeDef::CFGR1"][::core::mem::offset_of!(ADC_TypeDef, CFGR1) - 12usize];
    ["Offset of field: ADC_TypeDef::CFGR2"][::core::mem::offset_of!(ADC_TypeDef, CFGR2) - 16usize];
    ["Offset of field: ADC_TypeDef::SMPR"][::core::mem::offset_of!(ADC_TypeDef, SMPR) - 20usize];
    ["Offset of field: ADC_TypeDef::RESERVED1"]
        [::core::mem::offset_of!(ADC_TypeDef, RESERVED1) - 24usize];
    ["Offset of field: ADC_TypeDef::RESERVED2"]
        [::core::mem::offset_of!(ADC_TypeDef, RESERVED2) - 28usize];
    ["Offset of field: ADC_TypeDef::TR"][::core::mem::offset_of!(ADC_TypeDef, TR) - 32usize];
    ["Offset of field: ADC_TypeDef::RESERVED3"]
        [::core::mem::offset_of!(ADC_TypeDef, RESERVED3) - 36usize];
    ["Offset of field: ADC_TypeDef::CHSELR"]
        [::core::mem::offset_of!(ADC_TypeDef, CHSELR) - 40usize];
    ["Offset of field: ADC_TypeDef::RESERVED4"]
        [::core::mem::offset_of!(ADC_TypeDef, RESERVED4) - 44usize];
    ["Offset of field: ADC_TypeDef::DR"][::core::mem::offset_of!(ADC_TypeDef, DR) - 64usize];
    ["Offset of field: ADC_TypeDef::RESERVED5"]
        [::core::mem::offset_of!(ADC_TypeDef, RESERVED5) - 68usize];
    ["Offset of field: ADC_TypeDef::CALFACT"]
        [::core::mem::offset_of!(ADC_TypeDef, CALFACT) - 180usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ADC_Common_TypeDef {
    pub CCR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ADC_Common_TypeDef"][::core::mem::size_of::<ADC_Common_TypeDef>() - 4usize];
    ["Alignment of ADC_Common_TypeDef"][::core::mem::align_of::<ADC_Common_TypeDef>() - 4usize];
    ["Offset of field: ADC_Common_TypeDef::CCR"]
        [::core::mem::offset_of!(ADC_Common_TypeDef, CCR) - 0usize];
};
#[doc = " @brief Comparator"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct COMP_TypeDef {
    #[doc = "< COMP comparator control and status register, Address offset: 0x18"]
    pub CSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of COMP_TypeDef"][::core::mem::size_of::<COMP_TypeDef>() - 4usize];
    ["Alignment of COMP_TypeDef"][::core::mem::align_of::<COMP_TypeDef>() - 4usize];
    ["Offset of field: COMP_TypeDef::CSR"][::core::mem::offset_of!(COMP_TypeDef, CSR) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct COMP_Common_TypeDef {
    #[doc = "< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00"]
    pub CSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of COMP_Common_TypeDef"][::core::mem::size_of::<COMP_Common_TypeDef>() - 4usize];
    ["Alignment of COMP_Common_TypeDef"][::core::mem::align_of::<COMP_Common_TypeDef>() - 4usize];
    ["Offset of field: COMP_Common_TypeDef::CSR"]
        [::core::mem::offset_of!(COMP_Common_TypeDef, CSR) - 0usize];
};
#[doc = " @brief CRC calculation unit"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CRC_TypeDef {
    #[doc = "< CRC Data register,                            Address offset: 0x00"]
    pub DR: u32,
    #[doc = "< CRC Independent data register,                Address offset: 0x04"]
    pub IDR: u8,
    #[doc = "< Reserved,                                                     0x05"]
    pub RESERVED0: u8,
    #[doc = "< Reserved,                                                     0x06"]
    pub RESERVED1: u16,
    #[doc = "< CRC Control register,                         Address offset: 0x08"]
    pub CR: u32,
    #[doc = "< Reserved,                                                     0x0C"]
    pub RESERVED2: u32,
    #[doc = "< Initial CRC value register,                   Address offset: 0x10"]
    pub INIT: u32,
    #[doc = "< CRC polynomial register,                      Address offset: 0x14"]
    pub POL: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CRC_TypeDef"][::core::mem::size_of::<CRC_TypeDef>() - 24usize];
    ["Alignment of CRC_TypeDef"][::core::mem::align_of::<CRC_TypeDef>() - 4usize];
    ["Offset of field: CRC_TypeDef::DR"][::core::mem::offset_of!(CRC_TypeDef, DR) - 0usize];
    ["Offset of field: CRC_TypeDef::IDR"][::core::mem::offset_of!(CRC_TypeDef, IDR) - 4usize];
    ["Offset of field: CRC_TypeDef::RESERVED0"]
        [::core::mem::offset_of!(CRC_TypeDef, RESERVED0) - 5usize];
    ["Offset of field: CRC_TypeDef::RESERVED1"]
        [::core::mem::offset_of!(CRC_TypeDef, RESERVED1) - 6usize];
    ["Offset of field: CRC_TypeDef::CR"][::core::mem::offset_of!(CRC_TypeDef, CR) - 8usize];
    ["Offset of field: CRC_TypeDef::RESERVED2"]
        [::core::mem::offset_of!(CRC_TypeDef, RESERVED2) - 12usize];
    ["Offset of field: CRC_TypeDef::INIT"][::core::mem::offset_of!(CRC_TypeDef, INIT) - 16usize];
    ["Offset of field: CRC_TypeDef::POL"][::core::mem::offset_of!(CRC_TypeDef, POL) - 20usize];
};
#[doc = " @brief Clock Recovery System"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CRS_TypeDef {
    #[doc = "< CRS ccontrol register,              Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< CRS configuration register,         Address offset: 0x04"]
    pub CFGR: u32,
    #[doc = "< CRS interrupt and status register,  Address offset: 0x08"]
    pub ISR: u32,
    #[doc = "< CRS interrupt flag clear register,  Address offset: 0x0C"]
    pub ICR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CRS_TypeDef"][::core::mem::size_of::<CRS_TypeDef>() - 16usize];
    ["Alignment of CRS_TypeDef"][::core::mem::align_of::<CRS_TypeDef>() - 4usize];
    ["Offset of field: CRS_TypeDef::CR"][::core::mem::offset_of!(CRS_TypeDef, CR) - 0usize];
    ["Offset of field: CRS_TypeDef::CFGR"][::core::mem::offset_of!(CRS_TypeDef, CFGR) - 4usize];
    ["Offset of field: CRS_TypeDef::ISR"][::core::mem::offset_of!(CRS_TypeDef, ISR) - 8usize];
    ["Offset of field: CRS_TypeDef::ICR"][::core::mem::offset_of!(CRS_TypeDef, ICR) - 12usize];
};
#[doc = " @brief Digital to Analog Converter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DAC_TypeDef {
    #[doc = "< DAC control register,                                    Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< DAC software trigger register,                           Address offset: 0x04"]
    pub SWTRIGR: u32,
    #[doc = "< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08"]
    pub DHR12R1: u32,
    #[doc = "< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C"]
    pub DHR12L1: u32,
    #[doc = "< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10"]
    pub DHR8R1: u32,
    #[doc = "< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14"]
    pub DHR12R2: u32,
    #[doc = "< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18"]
    pub DHR12L2: u32,
    #[doc = "< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C"]
    pub DHR8R2: u32,
    #[doc = "< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20"]
    pub DHR12RD: u32,
    #[doc = "< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24"]
    pub DHR12LD: u32,
    #[doc = "< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28"]
    pub DHR8RD: u32,
    #[doc = "< DAC channel1 data output register,                       Address offset: 0x2C"]
    pub DOR1: u32,
    #[doc = "< DAC channel2 data output register,                       Address offset: 0x30"]
    pub DOR2: u32,
    #[doc = "< DAC status register,                                     Address offset: 0x34"]
    pub SR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DAC_TypeDef"][::core::mem::size_of::<DAC_TypeDef>() - 56usize];
    ["Alignment of DAC_TypeDef"][::core::mem::align_of::<DAC_TypeDef>() - 4usize];
    ["Offset of field: DAC_TypeDef::CR"][::core::mem::offset_of!(DAC_TypeDef, CR) - 0usize];
    ["Offset of field: DAC_TypeDef::SWTRIGR"]
        [::core::mem::offset_of!(DAC_TypeDef, SWTRIGR) - 4usize];
    ["Offset of field: DAC_TypeDef::DHR12R1"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12R1) - 8usize];
    ["Offset of field: DAC_TypeDef::DHR12L1"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12L1) - 12usize];
    ["Offset of field: DAC_TypeDef::DHR8R1"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR8R1) - 16usize];
    ["Offset of field: DAC_TypeDef::DHR12R2"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12R2) - 20usize];
    ["Offset of field: DAC_TypeDef::DHR12L2"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12L2) - 24usize];
    ["Offset of field: DAC_TypeDef::DHR8R2"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR8R2) - 28usize];
    ["Offset of field: DAC_TypeDef::DHR12RD"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12RD) - 32usize];
    ["Offset of field: DAC_TypeDef::DHR12LD"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR12LD) - 36usize];
    ["Offset of field: DAC_TypeDef::DHR8RD"]
        [::core::mem::offset_of!(DAC_TypeDef, DHR8RD) - 40usize];
    ["Offset of field: DAC_TypeDef::DOR1"][::core::mem::offset_of!(DAC_TypeDef, DOR1) - 44usize];
    ["Offset of field: DAC_TypeDef::DOR2"][::core::mem::offset_of!(DAC_TypeDef, DOR2) - 48usize];
    ["Offset of field: DAC_TypeDef::SR"][::core::mem::offset_of!(DAC_TypeDef, SR) - 52usize];
};
#[doc = " @brief Debug MCU"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DBGMCU_TypeDef {
    #[doc = "< MCU device ID code,                          Address offset: 0x00"]
    pub IDCODE: u32,
    #[doc = "< Debug MCU configuration register,            Address offset: 0x04"]
    pub CR: u32,
    #[doc = "< Debug MCU APB1 freeze register,              Address offset: 0x08"]
    pub APB1FZ: u32,
    #[doc = "< Debug MCU APB2 freeze register,              Address offset: 0x0C"]
    pub APB2FZ: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DBGMCU_TypeDef"][::core::mem::size_of::<DBGMCU_TypeDef>() - 16usize];
    ["Alignment of DBGMCU_TypeDef"][::core::mem::align_of::<DBGMCU_TypeDef>() - 4usize];
    ["Offset of field: DBGMCU_TypeDef::IDCODE"]
        [::core::mem::offset_of!(DBGMCU_TypeDef, IDCODE) - 0usize];
    ["Offset of field: DBGMCU_TypeDef::CR"][::core::mem::offset_of!(DBGMCU_TypeDef, CR) - 4usize];
    ["Offset of field: DBGMCU_TypeDef::APB1FZ"]
        [::core::mem::offset_of!(DBGMCU_TypeDef, APB1FZ) - 8usize];
    ["Offset of field: DBGMCU_TypeDef::APB2FZ"]
        [::core::mem::offset_of!(DBGMCU_TypeDef, APB2FZ) - 12usize];
};
#[doc = " @brief DMA Controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_Channel_TypeDef {
    #[doc = "< DMA channel x configuration register"]
    pub CCR: u32,
    #[doc = "< DMA channel x number of data register"]
    pub CNDTR: u32,
    #[doc = "< DMA channel x peripheral address register"]
    pub CPAR: u32,
    #[doc = "< DMA channel x memory address register"]
    pub CMAR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_Channel_TypeDef"][::core::mem::size_of::<DMA_Channel_TypeDef>() - 16usize];
    ["Alignment of DMA_Channel_TypeDef"][::core::mem::align_of::<DMA_Channel_TypeDef>() - 4usize];
    ["Offset of field: DMA_Channel_TypeDef::CCR"]
        [::core::mem::offset_of!(DMA_Channel_TypeDef, CCR) - 0usize];
    ["Offset of field: DMA_Channel_TypeDef::CNDTR"]
        [::core::mem::offset_of!(DMA_Channel_TypeDef, CNDTR) - 4usize];
    ["Offset of field: DMA_Channel_TypeDef::CPAR"]
        [::core::mem::offset_of!(DMA_Channel_TypeDef, CPAR) - 8usize];
    ["Offset of field: DMA_Channel_TypeDef::CMAR"]
        [::core::mem::offset_of!(DMA_Channel_TypeDef, CMAR) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_TypeDef {
    #[doc = "< DMA interrupt status register,               Address offset: 0x00"]
    pub ISR: u32,
    #[doc = "< DMA interrupt flag clear register,           Address offset: 0x04"]
    pub IFCR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_TypeDef"][::core::mem::size_of::<DMA_TypeDef>() - 8usize];
    ["Alignment of DMA_TypeDef"][::core::mem::align_of::<DMA_TypeDef>() - 4usize];
    ["Offset of field: DMA_TypeDef::ISR"][::core::mem::offset_of!(DMA_TypeDef, ISR) - 0usize];
    ["Offset of field: DMA_TypeDef::IFCR"][::core::mem::offset_of!(DMA_TypeDef, IFCR) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DMA_Request_TypeDef {
    #[doc = "< DMA channel selection register,              Address offset: 0xA8"]
    pub CSELR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_Request_TypeDef"][::core::mem::size_of::<DMA_Request_TypeDef>() - 4usize];
    ["Alignment of DMA_Request_TypeDef"][::core::mem::align_of::<DMA_Request_TypeDef>() - 4usize];
    ["Offset of field: DMA_Request_TypeDef::CSELR"]
        [::core::mem::offset_of!(DMA_Request_TypeDef, CSELR) - 0usize];
};
#[doc = " @brief External Interrupt/Event Controller"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EXTI_TypeDef {
    #[doc = "<EXTI Interrupt mask register,                 Address offset: 0x00"]
    pub IMR: u32,
    #[doc = "<EXTI Event mask register,                     Address offset: 0x04"]
    pub EMR: u32,
    #[doc = "<EXTI Rising trigger selection register ,      Address offset: 0x08"]
    pub RTSR: u32,
    #[doc = "<EXTI Falling trigger selection register,      Address offset: 0x0C"]
    pub FTSR: u32,
    #[doc = "<EXTI Software interrupt event register,       Address offset: 0x10"]
    pub SWIER: u32,
    #[doc = "<EXTI Pending register,                        Address offset: 0x14"]
    pub PR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EXTI_TypeDef"][::core::mem::size_of::<EXTI_TypeDef>() - 24usize];
    ["Alignment of EXTI_TypeDef"][::core::mem::align_of::<EXTI_TypeDef>() - 4usize];
    ["Offset of field: EXTI_TypeDef::IMR"][::core::mem::offset_of!(EXTI_TypeDef, IMR) - 0usize];
    ["Offset of field: EXTI_TypeDef::EMR"][::core::mem::offset_of!(EXTI_TypeDef, EMR) - 4usize];
    ["Offset of field: EXTI_TypeDef::RTSR"][::core::mem::offset_of!(EXTI_TypeDef, RTSR) - 8usize];
    ["Offset of field: EXTI_TypeDef::FTSR"][::core::mem::offset_of!(EXTI_TypeDef, FTSR) - 12usize];
    ["Offset of field: EXTI_TypeDef::SWIER"]
        [::core::mem::offset_of!(EXTI_TypeDef, SWIER) - 16usize];
    ["Offset of field: EXTI_TypeDef::PR"][::core::mem::offset_of!(EXTI_TypeDef, PR) - 20usize];
};
#[doc = " @brief FLASH Registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FLASH_TypeDef {
    #[doc = "< Access control register,                     Address offset: 0x00"]
    pub ACR: u32,
    #[doc = "< Program/erase control register,              Address offset: 0x04"]
    pub PECR: u32,
    #[doc = "< Power down key register,                     Address offset: 0x08"]
    pub PDKEYR: u32,
    #[doc = "< Program/erase key register,                  Address offset: 0x0c"]
    pub PEKEYR: u32,
    #[doc = "< Program memory key register,                 Address offset: 0x10"]
    pub PRGKEYR: u32,
    #[doc = "< Option byte key register,                    Address offset: 0x14"]
    pub OPTKEYR: u32,
    #[doc = "< Status register,                             Address offset: 0x18"]
    pub SR: u32,
    #[doc = "< Option byte register,                        Address offset: 0x1c"]
    pub OPTR: u32,
    #[doc = "< Write protection register,                   Address offset: 0x20"]
    pub WRPR: u32,
    #[doc = "< Reserved1,                                   Address offset: 0x24"]
    pub RESERVED1: [u32; 23usize],
    #[doc = "< Write protection register 2,                 Address offset: 0x80"]
    pub WRPR2: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FLASH_TypeDef"][::core::mem::size_of::<FLASH_TypeDef>() - 132usize];
    ["Alignment of FLASH_TypeDef"][::core::mem::align_of::<FLASH_TypeDef>() - 4usize];
    ["Offset of field: FLASH_TypeDef::ACR"][::core::mem::offset_of!(FLASH_TypeDef, ACR) - 0usize];
    ["Offset of field: FLASH_TypeDef::PECR"][::core::mem::offset_of!(FLASH_TypeDef, PECR) - 4usize];
    ["Offset of field: FLASH_TypeDef::PDKEYR"]
        [::core::mem::offset_of!(FLASH_TypeDef, PDKEYR) - 8usize];
    ["Offset of field: FLASH_TypeDef::PEKEYR"]
        [::core::mem::offset_of!(FLASH_TypeDef, PEKEYR) - 12usize];
    ["Offset of field: FLASH_TypeDef::PRGKEYR"]
        [::core::mem::offset_of!(FLASH_TypeDef, PRGKEYR) - 16usize];
    ["Offset of field: FLASH_TypeDef::OPTKEYR"]
        [::core::mem::offset_of!(FLASH_TypeDef, OPTKEYR) - 20usize];
    ["Offset of field: FLASH_TypeDef::SR"][::core::mem::offset_of!(FLASH_TypeDef, SR) - 24usize];
    ["Offset of field: FLASH_TypeDef::OPTR"]
        [::core::mem::offset_of!(FLASH_TypeDef, OPTR) - 28usize];
    ["Offset of field: FLASH_TypeDef::WRPR"]
        [::core::mem::offset_of!(FLASH_TypeDef, WRPR) - 32usize];
    ["Offset of field: FLASH_TypeDef::RESERVED1"]
        [::core::mem::offset_of!(FLASH_TypeDef, RESERVED1) - 36usize];
    ["Offset of field: FLASH_TypeDef::WRPR2"]
        [::core::mem::offset_of!(FLASH_TypeDef, WRPR2) - 128usize];
};
#[doc = " @brief Option Bytes Registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OB_TypeDef {
    #[doc = "< Read protection register,               Address offset: 0x00"]
    pub RDP: u32,
    #[doc = "< user register,                          Address offset: 0x04"]
    pub USER: u32,
    #[doc = "< write protection Bytes 0 and 1          Address offset: 0x08"]
    pub WRP01: u32,
    #[doc = "< write protection Bytes 2 and 3          Address offset: 0x0C"]
    pub WRP23: u32,
    #[doc = "< write protection Bytes 4 and 5          Address offset: 0x10"]
    pub WRP45: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OB_TypeDef"][::core::mem::size_of::<OB_TypeDef>() - 20usize];
    ["Alignment of OB_TypeDef"][::core::mem::align_of::<OB_TypeDef>() - 4usize];
    ["Offset of field: OB_TypeDef::RDP"][::core::mem::offset_of!(OB_TypeDef, RDP) - 0usize];
    ["Offset of field: OB_TypeDef::USER"][::core::mem::offset_of!(OB_TypeDef, USER) - 4usize];
    ["Offset of field: OB_TypeDef::WRP01"][::core::mem::offset_of!(OB_TypeDef, WRP01) - 8usize];
    ["Offset of field: OB_TypeDef::WRP23"][::core::mem::offset_of!(OB_TypeDef, WRP23) - 12usize];
    ["Offset of field: OB_TypeDef::WRP45"][::core::mem::offset_of!(OB_TypeDef, WRP45) - 16usize];
};
#[doc = " @brief General Purpose IO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GPIO_TypeDef {
    #[doc = "< GPIO port mode register,                     Address offset: 0x00"]
    pub MODER: u32,
    #[doc = "< GPIO port output type register,              Address offset: 0x04"]
    pub OTYPER: u32,
    #[doc = "< GPIO port output speed register,             Address offset: 0x08"]
    pub OSPEEDR: u32,
    #[doc = "< GPIO port pull-up/pull-down register,        Address offset: 0x0C"]
    pub PUPDR: u32,
    #[doc = "< GPIO port input data register,               Address offset: 0x10"]
    pub IDR: u32,
    #[doc = "< GPIO port output data register,              Address offset: 0x14"]
    pub ODR: u32,
    #[doc = "< GPIO port bit set/reset registerBSRR,        Address offset: 0x18"]
    pub BSRR: u32,
    #[doc = "< GPIO port configuration lock register,       Address offset: 0x1C"]
    pub LCKR: u32,
    #[doc = "< GPIO alternate function register,            Address offset: 0x20-0x24"]
    pub AFR: [u32; 2usize],
    #[doc = "< GPIO bit reset register,                     Address offset: 0x28"]
    pub BRR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GPIO_TypeDef"][::core::mem::size_of::<GPIO_TypeDef>() - 44usize];
    ["Alignment of GPIO_TypeDef"][::core::mem::align_of::<GPIO_TypeDef>() - 4usize];
    ["Offset of field: GPIO_TypeDef::MODER"][::core::mem::offset_of!(GPIO_TypeDef, MODER) - 0usize];
    ["Offset of field: GPIO_TypeDef::OTYPER"]
        [::core::mem::offset_of!(GPIO_TypeDef, OTYPER) - 4usize];
    ["Offset of field: GPIO_TypeDef::OSPEEDR"]
        [::core::mem::offset_of!(GPIO_TypeDef, OSPEEDR) - 8usize];
    ["Offset of field: GPIO_TypeDef::PUPDR"]
        [::core::mem::offset_of!(GPIO_TypeDef, PUPDR) - 12usize];
    ["Offset of field: GPIO_TypeDef::IDR"][::core::mem::offset_of!(GPIO_TypeDef, IDR) - 16usize];
    ["Offset of field: GPIO_TypeDef::ODR"][::core::mem::offset_of!(GPIO_TypeDef, ODR) - 20usize];
    ["Offset of field: GPIO_TypeDef::BSRR"][::core::mem::offset_of!(GPIO_TypeDef, BSRR) - 24usize];
    ["Offset of field: GPIO_TypeDef::LCKR"][::core::mem::offset_of!(GPIO_TypeDef, LCKR) - 28usize];
    ["Offset of field: GPIO_TypeDef::AFR"][::core::mem::offset_of!(GPIO_TypeDef, AFR) - 32usize];
    ["Offset of field: GPIO_TypeDef::BRR"][::core::mem::offset_of!(GPIO_TypeDef, BRR) - 40usize];
};
#[doc = " @brief LPTIMIMER"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LPTIM_TypeDef {
    #[doc = "< LPTIM Interrupt and Status register,             Address offset: 0x00"]
    pub ISR: u32,
    #[doc = "< LPTIM Interrupt Clear register,                  Address offset: 0x04"]
    pub ICR: u32,
    #[doc = "< LPTIM Interrupt Enable register,                 Address offset: 0x08"]
    pub IER: u32,
    #[doc = "< LPTIM Configuration register,                    Address offset: 0x0C"]
    pub CFGR: u32,
    #[doc = "< LPTIM Control register,                          Address offset: 0x10"]
    pub CR: u32,
    #[doc = "< LPTIM Compare register,                          Address offset: 0x14"]
    pub CMP: u32,
    #[doc = "< LPTIM Autoreload register,                       Address offset: 0x18"]
    pub ARR: u32,
    #[doc = "< LPTIM Counter register,                          Address offset: 0x1C"]
    pub CNT: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LPTIM_TypeDef"][::core::mem::size_of::<LPTIM_TypeDef>() - 32usize];
    ["Alignment of LPTIM_TypeDef"][::core::mem::align_of::<LPTIM_TypeDef>() - 4usize];
    ["Offset of field: LPTIM_TypeDef::ISR"][::core::mem::offset_of!(LPTIM_TypeDef, ISR) - 0usize];
    ["Offset of field: LPTIM_TypeDef::ICR"][::core::mem::offset_of!(LPTIM_TypeDef, ICR) - 4usize];
    ["Offset of field: LPTIM_TypeDef::IER"][::core::mem::offset_of!(LPTIM_TypeDef, IER) - 8usize];
    ["Offset of field: LPTIM_TypeDef::CFGR"]
        [::core::mem::offset_of!(LPTIM_TypeDef, CFGR) - 12usize];
    ["Offset of field: LPTIM_TypeDef::CR"][::core::mem::offset_of!(LPTIM_TypeDef, CR) - 16usize];
    ["Offset of field: LPTIM_TypeDef::CMP"][::core::mem::offset_of!(LPTIM_TypeDef, CMP) - 20usize];
    ["Offset of field: LPTIM_TypeDef::ARR"][::core::mem::offset_of!(LPTIM_TypeDef, ARR) - 24usize];
    ["Offset of field: LPTIM_TypeDef::CNT"][::core::mem::offset_of!(LPTIM_TypeDef, CNT) - 28usize];
};
#[doc = " @brief SysTem Configuration"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SYSCFG_TypeDef {
    #[doc = "< SYSCFG configuration register 1,                    Address offset: 0x00"]
    pub CFGR1: u32,
    #[doc = "< SYSCFG configuration register 2,                    Address offset: 0x04"]
    pub CFGR2: u32,
    #[doc = "< SYSCFG external interrupt configuration register,   Address offset: 0x14-0x08"]
    pub EXTICR: [u32; 4usize],
    #[doc = "< Reserved,                                           0x18-0x1C"]
    pub RESERVED: [u32; 2usize],
    #[doc = "< SYSCFG configuration register 3,                    Address offset: 0x20"]
    pub CFGR3: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SYSCFG_TypeDef"][::core::mem::size_of::<SYSCFG_TypeDef>() - 36usize];
    ["Alignment of SYSCFG_TypeDef"][::core::mem::align_of::<SYSCFG_TypeDef>() - 4usize];
    ["Offset of field: SYSCFG_TypeDef::CFGR1"]
        [::core::mem::offset_of!(SYSCFG_TypeDef, CFGR1) - 0usize];
    ["Offset of field: SYSCFG_TypeDef::CFGR2"]
        [::core::mem::offset_of!(SYSCFG_TypeDef, CFGR2) - 4usize];
    ["Offset of field: SYSCFG_TypeDef::EXTICR"]
        [::core::mem::offset_of!(SYSCFG_TypeDef, EXTICR) - 8usize];
    ["Offset of field: SYSCFG_TypeDef::RESERVED"]
        [::core::mem::offset_of!(SYSCFG_TypeDef, RESERVED) - 24usize];
    ["Offset of field: SYSCFG_TypeDef::CFGR3"]
        [::core::mem::offset_of!(SYSCFG_TypeDef, CFGR3) - 32usize];
};
#[doc = " @brief Inter-integrated Circuit Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct I2C_TypeDef {
    #[doc = "< I2C Control register 1,            Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< I2C Control register 2,            Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< I2C Own address 1 register,        Address offset: 0x08"]
    pub OAR1: u32,
    #[doc = "< I2C Own address 2 register,        Address offset: 0x0C"]
    pub OAR2: u32,
    #[doc = "< I2C Timing register,               Address offset: 0x10"]
    pub TIMINGR: u32,
    #[doc = "< I2C Timeout register,              Address offset: 0x14"]
    pub TIMEOUTR: u32,
    #[doc = "< I2C Interrupt and status register, Address offset: 0x18"]
    pub ISR: u32,
    #[doc = "< I2C Interrupt clear register,      Address offset: 0x1C"]
    pub ICR: u32,
    #[doc = "< I2C PEC register,                  Address offset: 0x20"]
    pub PECR: u32,
    #[doc = "< I2C Receive data register,         Address offset: 0x24"]
    pub RXDR: u32,
    #[doc = "< I2C Transmit data register,        Address offset: 0x28"]
    pub TXDR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2C_TypeDef"][::core::mem::size_of::<I2C_TypeDef>() - 44usize];
    ["Alignment of I2C_TypeDef"][::core::mem::align_of::<I2C_TypeDef>() - 4usize];
    ["Offset of field: I2C_TypeDef::CR1"][::core::mem::offset_of!(I2C_TypeDef, CR1) - 0usize];
    ["Offset of field: I2C_TypeDef::CR2"][::core::mem::offset_of!(I2C_TypeDef, CR2) - 4usize];
    ["Offset of field: I2C_TypeDef::OAR1"][::core::mem::offset_of!(I2C_TypeDef, OAR1) - 8usize];
    ["Offset of field: I2C_TypeDef::OAR2"][::core::mem::offset_of!(I2C_TypeDef, OAR2) - 12usize];
    ["Offset of field: I2C_TypeDef::TIMINGR"]
        [::core::mem::offset_of!(I2C_TypeDef, TIMINGR) - 16usize];
    ["Offset of field: I2C_TypeDef::TIMEOUTR"]
        [::core::mem::offset_of!(I2C_TypeDef, TIMEOUTR) - 20usize];
    ["Offset of field: I2C_TypeDef::ISR"][::core::mem::offset_of!(I2C_TypeDef, ISR) - 24usize];
    ["Offset of field: I2C_TypeDef::ICR"][::core::mem::offset_of!(I2C_TypeDef, ICR) - 28usize];
    ["Offset of field: I2C_TypeDef::PECR"][::core::mem::offset_of!(I2C_TypeDef, PECR) - 32usize];
    ["Offset of field: I2C_TypeDef::RXDR"][::core::mem::offset_of!(I2C_TypeDef, RXDR) - 36usize];
    ["Offset of field: I2C_TypeDef::TXDR"][::core::mem::offset_of!(I2C_TypeDef, TXDR) - 40usize];
};
#[doc = " @brief Independent WATCHDOG"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IWDG_TypeDef {
    #[doc = "< IWDG Key register,       Address offset: 0x00"]
    pub KR: u32,
    #[doc = "< IWDG Prescaler register, Address offset: 0x04"]
    pub PR: u32,
    #[doc = "< IWDG Reload register,    Address offset: 0x08"]
    pub RLR: u32,
    #[doc = "< IWDG Status register,    Address offset: 0x0C"]
    pub SR: u32,
    #[doc = "< IWDG Window register,    Address offset: 0x10"]
    pub WINR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IWDG_TypeDef"][::core::mem::size_of::<IWDG_TypeDef>() - 20usize];
    ["Alignment of IWDG_TypeDef"][::core::mem::align_of::<IWDG_TypeDef>() - 4usize];
    ["Offset of field: IWDG_TypeDef::KR"][::core::mem::offset_of!(IWDG_TypeDef, KR) - 0usize];
    ["Offset of field: IWDG_TypeDef::PR"][::core::mem::offset_of!(IWDG_TypeDef, PR) - 4usize];
    ["Offset of field: IWDG_TypeDef::RLR"][::core::mem::offset_of!(IWDG_TypeDef, RLR) - 8usize];
    ["Offset of field: IWDG_TypeDef::SR"][::core::mem::offset_of!(IWDG_TypeDef, SR) - 12usize];
    ["Offset of field: IWDG_TypeDef::WINR"][::core::mem::offset_of!(IWDG_TypeDef, WINR) - 16usize];
};
#[doc = " @brief MIFARE Firewall"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FIREWALL_TypeDef {
    #[doc = "< Code Segment Start Address register,               Address offset: 0x00"]
    pub CSSA: u32,
    #[doc = "< Code Segment Length register,                      Address offset: 0x04"]
    pub CSL: u32,
    #[doc = "< NON volatile data Segment Start Address register,  Address offset: 0x08"]
    pub NVDSSA: u32,
    #[doc = "< NON volatile data Segment Length register,         Address offset: 0x0C"]
    pub NVDSL: u32,
    #[doc = "< Volatile data Segment Start Address register,      Address offset: 0x10"]
    pub VDSSA: u32,
    #[doc = "< Volatile data Segment Length register,             Address offset: 0x14"]
    pub VDSL: u32,
    #[doc = "< Library Segment Start Address register,            Address offset: 0x18"]
    pub LSSA: u32,
    #[doc = "< Library Segment Length register,                   Address offset: 0x1C"]
    pub LSL: u32,
    #[doc = "< Configuration  register,                           Address offset: 0x20"]
    pub CR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FIREWALL_TypeDef"][::core::mem::size_of::<FIREWALL_TypeDef>() - 36usize];
    ["Alignment of FIREWALL_TypeDef"][::core::mem::align_of::<FIREWALL_TypeDef>() - 4usize];
    ["Offset of field: FIREWALL_TypeDef::CSSA"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, CSSA) - 0usize];
    ["Offset of field: FIREWALL_TypeDef::CSL"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, CSL) - 4usize];
    ["Offset of field: FIREWALL_TypeDef::NVDSSA"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, NVDSSA) - 8usize];
    ["Offset of field: FIREWALL_TypeDef::NVDSL"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, NVDSL) - 12usize];
    ["Offset of field: FIREWALL_TypeDef::VDSSA"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, VDSSA) - 16usize];
    ["Offset of field: FIREWALL_TypeDef::VDSL"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, VDSL) - 20usize];
    ["Offset of field: FIREWALL_TypeDef::LSSA"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, LSSA) - 24usize];
    ["Offset of field: FIREWALL_TypeDef::LSL"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, LSL) - 28usize];
    ["Offset of field: FIREWALL_TypeDef::CR"]
        [::core::mem::offset_of!(FIREWALL_TypeDef, CR) - 32usize];
};
#[doc = " @brief Power Control"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PWR_TypeDef {
    #[doc = "< PWR power control register,        Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< PWR power control/status register, Address offset: 0x04"]
    pub CSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PWR_TypeDef"][::core::mem::size_of::<PWR_TypeDef>() - 8usize];
    ["Alignment of PWR_TypeDef"][::core::mem::align_of::<PWR_TypeDef>() - 4usize];
    ["Offset of field: PWR_TypeDef::CR"][::core::mem::offset_of!(PWR_TypeDef, CR) - 0usize];
    ["Offset of field: PWR_TypeDef::CSR"][::core::mem::offset_of!(PWR_TypeDef, CSR) - 4usize];
};
#[doc = " @brief Reset and Clock Control"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RCC_TypeDef {
    #[doc = "< RCC clock control register,                                   Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< RCC Internal clock sources calibration register,              Address offset: 0x04"]
    pub ICSCR: u32,
    #[doc = "< RCC Clock recovery RC register,                               Address offset: 0x08"]
    pub CRRCR: u32,
    #[doc = "< RCC Clock configuration register,                             Address offset: 0x0C"]
    pub CFGR: u32,
    #[doc = "< RCC Clock interrupt enable register,                          Address offset: 0x10"]
    pub CIER: u32,
    #[doc = "< RCC Clock interrupt flag register,                            Address offset: 0x14"]
    pub CIFR: u32,
    #[doc = "< RCC Clock interrupt clear register,                           Address offset: 0x18"]
    pub CICR: u32,
    #[doc = "< RCC IO port reset register,                                   Address offset: 0x1C"]
    pub IOPRSTR: u32,
    #[doc = "< RCC AHB peripheral reset register,                            Address offset: 0x20"]
    pub AHBRSTR: u32,
    #[doc = "< RCC APB2 peripheral reset register,                           Address offset: 0x24"]
    pub APB2RSTR: u32,
    #[doc = "< RCC APB1 peripheral reset register,                           Address offset: 0x28"]
    pub APB1RSTR: u32,
    #[doc = "< RCC Clock IO port enable register,                            Address offset: 0x2C"]
    pub IOPENR: u32,
    #[doc = "< RCC AHB peripheral clock enable register,                     Address offset: 0x30"]
    pub AHBENR: u32,
    #[doc = "< RCC APB2 peripheral enable register,                          Address offset: 0x34"]
    pub APB2ENR: u32,
    #[doc = "< RCC APB1 peripheral enable register,                          Address offset: 0x38"]
    pub APB1ENR: u32,
    #[doc = "< RCC IO port clock enable in sleep mode register,              Address offset: 0x3C"]
    pub IOPSMENR: u32,
    #[doc = "< RCC AHB peripheral clock enable in sleep mode register,       Address offset: 0x40"]
    pub AHBSMENR: u32,
    #[doc = "< RCC APB2 peripheral clock enable in sleep mode register,      Address offset: 0x44"]
    pub APB2SMENR: u32,
    #[doc = "< RCC APB1 peripheral clock enable in sleep mode register,      Address offset: 0x48"]
    pub APB1SMENR: u32,
    #[doc = "< RCC clock configuration register,                             Address offset: 0x4C"]
    pub CCIPR: u32,
    #[doc = "< RCC Control/status register,                                  Address offset: 0x50"]
    pub CSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RCC_TypeDef"][::core::mem::size_of::<RCC_TypeDef>() - 84usize];
    ["Alignment of RCC_TypeDef"][::core::mem::align_of::<RCC_TypeDef>() - 4usize];
    ["Offset of field: RCC_TypeDef::CR"][::core::mem::offset_of!(RCC_TypeDef, CR) - 0usize];
    ["Offset of field: RCC_TypeDef::ICSCR"][::core::mem::offset_of!(RCC_TypeDef, ICSCR) - 4usize];
    ["Offset of field: RCC_TypeDef::CRRCR"][::core::mem::offset_of!(RCC_TypeDef, CRRCR) - 8usize];
    ["Offset of field: RCC_TypeDef::CFGR"][::core::mem::offset_of!(RCC_TypeDef, CFGR) - 12usize];
    ["Offset of field: RCC_TypeDef::CIER"][::core::mem::offset_of!(RCC_TypeDef, CIER) - 16usize];
    ["Offset of field: RCC_TypeDef::CIFR"][::core::mem::offset_of!(RCC_TypeDef, CIFR) - 20usize];
    ["Offset of field: RCC_TypeDef::CICR"][::core::mem::offset_of!(RCC_TypeDef, CICR) - 24usize];
    ["Offset of field: RCC_TypeDef::IOPRSTR"]
        [::core::mem::offset_of!(RCC_TypeDef, IOPRSTR) - 28usize];
    ["Offset of field: RCC_TypeDef::AHBRSTR"]
        [::core::mem::offset_of!(RCC_TypeDef, AHBRSTR) - 32usize];
    ["Offset of field: RCC_TypeDef::APB2RSTR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB2RSTR) - 36usize];
    ["Offset of field: RCC_TypeDef::APB1RSTR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB1RSTR) - 40usize];
    ["Offset of field: RCC_TypeDef::IOPENR"]
        [::core::mem::offset_of!(RCC_TypeDef, IOPENR) - 44usize];
    ["Offset of field: RCC_TypeDef::AHBENR"]
        [::core::mem::offset_of!(RCC_TypeDef, AHBENR) - 48usize];
    ["Offset of field: RCC_TypeDef::APB2ENR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB2ENR) - 52usize];
    ["Offset of field: RCC_TypeDef::APB1ENR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB1ENR) - 56usize];
    ["Offset of field: RCC_TypeDef::IOPSMENR"]
        [::core::mem::offset_of!(RCC_TypeDef, IOPSMENR) - 60usize];
    ["Offset of field: RCC_TypeDef::AHBSMENR"]
        [::core::mem::offset_of!(RCC_TypeDef, AHBSMENR) - 64usize];
    ["Offset of field: RCC_TypeDef::APB2SMENR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB2SMENR) - 68usize];
    ["Offset of field: RCC_TypeDef::APB1SMENR"]
        [::core::mem::offset_of!(RCC_TypeDef, APB1SMENR) - 72usize];
    ["Offset of field: RCC_TypeDef::CCIPR"][::core::mem::offset_of!(RCC_TypeDef, CCIPR) - 76usize];
    ["Offset of field: RCC_TypeDef::CSR"][::core::mem::offset_of!(RCC_TypeDef, CSR) - 80usize];
};
#[doc = " @brief Random numbers generator"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RNG_TypeDef {
    #[doc = "< RNG control register, Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< RNG status register,  Address offset: 0x04"]
    pub SR: u32,
    #[doc = "< RNG data register,    Address offset: 0x08"]
    pub DR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RNG_TypeDef"][::core::mem::size_of::<RNG_TypeDef>() - 12usize];
    ["Alignment of RNG_TypeDef"][::core::mem::align_of::<RNG_TypeDef>() - 4usize];
    ["Offset of field: RNG_TypeDef::CR"][::core::mem::offset_of!(RNG_TypeDef, CR) - 0usize];
    ["Offset of field: RNG_TypeDef::SR"][::core::mem::offset_of!(RNG_TypeDef, SR) - 4usize];
    ["Offset of field: RNG_TypeDef::DR"][::core::mem::offset_of!(RNG_TypeDef, DR) - 8usize];
};
#[doc = " @brief Real-Time Clock"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RTC_TypeDef {
    #[doc = "< RTC time register,                                         Address offset: 0x00"]
    pub TR: u32,
    #[doc = "< RTC date register,                                         Address offset: 0x04"]
    pub DR: u32,
    #[doc = "< RTC control register,                                      Address offset: 0x08"]
    pub CR: u32,
    #[doc = "< RTC initialization and status register,                    Address offset: 0x0C"]
    pub ISR: u32,
    #[doc = "< RTC prescaler register,                                    Address offset: 0x10"]
    pub PRER: u32,
    #[doc = "< RTC wakeup timer register,                                 Address offset: 0x14"]
    pub WUTR: u32,
    #[doc = "< Reserved,                                                  Address offset: 0x18"]
    pub RESERVED: u32,
    #[doc = "< RTC alarm A register,                                      Address offset: 0x1C"]
    pub ALRMAR: u32,
    #[doc = "< RTC alarm B register,                                      Address offset: 0x20"]
    pub ALRMBR: u32,
    #[doc = "< RTC write protection register,                             Address offset: 0x24"]
    pub WPR: u32,
    #[doc = "< RTC sub second register,                                   Address offset: 0x28"]
    pub SSR: u32,
    #[doc = "< RTC shift control register,                                Address offset: 0x2C"]
    pub SHIFTR: u32,
    #[doc = "< RTC time stamp time register,                              Address offset: 0x30"]
    pub TSTR: u32,
    #[doc = "< RTC time stamp date register,                              Address offset: 0x34"]
    pub TSDR: u32,
    #[doc = "< RTC time-stamp sub second register,                        Address offset: 0x38"]
    pub TSSSR: u32,
    #[doc = "< RTC calibration register,                                  Address offset: 0x3C"]
    pub CALR: u32,
    #[doc = "< RTC tamper configuration register,                         Address offset: 0x40"]
    pub TAMPCR: u32,
    #[doc = "< RTC alarm A sub second register,                           Address offset: 0x44"]
    pub ALRMASSR: u32,
    #[doc = "< RTC alarm B sub second register,                           Address offset: 0x48"]
    pub ALRMBSSR: u32,
    #[doc = "< RTC option register,                                       Address offset  0x4C"]
    pub OR: u32,
    #[doc = "< RTC backup register 0,                                     Address offset: 0x50"]
    pub BKP0R: u32,
    #[doc = "< RTC backup register 1,                                     Address offset: 0x54"]
    pub BKP1R: u32,
    #[doc = "< RTC backup register 2,                                     Address offset: 0x58"]
    pub BKP2R: u32,
    #[doc = "< RTC backup register 3,                                     Address offset: 0x5C"]
    pub BKP3R: u32,
    #[doc = "< RTC backup register 4,                                     Address offset: 0x60"]
    pub BKP4R: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RTC_TypeDef"][::core::mem::size_of::<RTC_TypeDef>() - 100usize];
    ["Alignment of RTC_TypeDef"][::core::mem::align_of::<RTC_TypeDef>() - 4usize];
    ["Offset of field: RTC_TypeDef::TR"][::core::mem::offset_of!(RTC_TypeDef, TR) - 0usize];
    ["Offset of field: RTC_TypeDef::DR"][::core::mem::offset_of!(RTC_TypeDef, DR) - 4usize];
    ["Offset of field: RTC_TypeDef::CR"][::core::mem::offset_of!(RTC_TypeDef, CR) - 8usize];
    ["Offset of field: RTC_TypeDef::ISR"][::core::mem::offset_of!(RTC_TypeDef, ISR) - 12usize];
    ["Offset of field: RTC_TypeDef::PRER"][::core::mem::offset_of!(RTC_TypeDef, PRER) - 16usize];
    ["Offset of field: RTC_TypeDef::WUTR"][::core::mem::offset_of!(RTC_TypeDef, WUTR) - 20usize];
    ["Offset of field: RTC_TypeDef::RESERVED"]
        [::core::mem::offset_of!(RTC_TypeDef, RESERVED) - 24usize];
    ["Offset of field: RTC_TypeDef::ALRMAR"]
        [::core::mem::offset_of!(RTC_TypeDef, ALRMAR) - 28usize];
    ["Offset of field: RTC_TypeDef::ALRMBR"]
        [::core::mem::offset_of!(RTC_TypeDef, ALRMBR) - 32usize];
    ["Offset of field: RTC_TypeDef::WPR"][::core::mem::offset_of!(RTC_TypeDef, WPR) - 36usize];
    ["Offset of field: RTC_TypeDef::SSR"][::core::mem::offset_of!(RTC_TypeDef, SSR) - 40usize];
    ["Offset of field: RTC_TypeDef::SHIFTR"]
        [::core::mem::offset_of!(RTC_TypeDef, SHIFTR) - 44usize];
    ["Offset of field: RTC_TypeDef::TSTR"][::core::mem::offset_of!(RTC_TypeDef, TSTR) - 48usize];
    ["Offset of field: RTC_TypeDef::TSDR"][::core::mem::offset_of!(RTC_TypeDef, TSDR) - 52usize];
    ["Offset of field: RTC_TypeDef::TSSSR"][::core::mem::offset_of!(RTC_TypeDef, TSSSR) - 56usize];
    ["Offset of field: RTC_TypeDef::CALR"][::core::mem::offset_of!(RTC_TypeDef, CALR) - 60usize];
    ["Offset of field: RTC_TypeDef::TAMPCR"]
        [::core::mem::offset_of!(RTC_TypeDef, TAMPCR) - 64usize];
    ["Offset of field: RTC_TypeDef::ALRMASSR"]
        [::core::mem::offset_of!(RTC_TypeDef, ALRMASSR) - 68usize];
    ["Offset of field: RTC_TypeDef::ALRMBSSR"]
        [::core::mem::offset_of!(RTC_TypeDef, ALRMBSSR) - 72usize];
    ["Offset of field: RTC_TypeDef::OR"][::core::mem::offset_of!(RTC_TypeDef, OR) - 76usize];
    ["Offset of field: RTC_TypeDef::BKP0R"][::core::mem::offset_of!(RTC_TypeDef, BKP0R) - 80usize];
    ["Offset of field: RTC_TypeDef::BKP1R"][::core::mem::offset_of!(RTC_TypeDef, BKP1R) - 84usize];
    ["Offset of field: RTC_TypeDef::BKP2R"][::core::mem::offset_of!(RTC_TypeDef, BKP2R) - 88usize];
    ["Offset of field: RTC_TypeDef::BKP3R"][::core::mem::offset_of!(RTC_TypeDef, BKP3R) - 92usize];
    ["Offset of field: RTC_TypeDef::BKP4R"][::core::mem::offset_of!(RTC_TypeDef, BKP4R) - 96usize];
};
#[doc = " @brief Serial Peripheral Interface"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SPI_TypeDef {
    #[doc = "< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< SPI Control register 2,                              Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< SPI Status register,                                 Address offset: 0x08"]
    pub SR: u32,
    #[doc = "< SPI data register,                                   Address offset: 0x0C"]
    pub DR: u32,
    #[doc = "< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10"]
    pub CRCPR: u32,
    #[doc = "< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14"]
    pub RXCRCR: u32,
    #[doc = "< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18"]
    pub TXCRCR: u32,
    #[doc = "< SPI_I2S configuration register,                      Address offset: 0x1C"]
    pub I2SCFGR: u32,
    #[doc = "< SPI_I2S prescaler register,                          Address offset: 0x20"]
    pub I2SPR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SPI_TypeDef"][::core::mem::size_of::<SPI_TypeDef>() - 36usize];
    ["Alignment of SPI_TypeDef"][::core::mem::align_of::<SPI_TypeDef>() - 4usize];
    ["Offset of field: SPI_TypeDef::CR1"][::core::mem::offset_of!(SPI_TypeDef, CR1) - 0usize];
    ["Offset of field: SPI_TypeDef::CR2"][::core::mem::offset_of!(SPI_TypeDef, CR2) - 4usize];
    ["Offset of field: SPI_TypeDef::SR"][::core::mem::offset_of!(SPI_TypeDef, SR) - 8usize];
    ["Offset of field: SPI_TypeDef::DR"][::core::mem::offset_of!(SPI_TypeDef, DR) - 12usize];
    ["Offset of field: SPI_TypeDef::CRCPR"][::core::mem::offset_of!(SPI_TypeDef, CRCPR) - 16usize];
    ["Offset of field: SPI_TypeDef::RXCRCR"]
        [::core::mem::offset_of!(SPI_TypeDef, RXCRCR) - 20usize];
    ["Offset of field: SPI_TypeDef::TXCRCR"]
        [::core::mem::offset_of!(SPI_TypeDef, TXCRCR) - 24usize];
    ["Offset of field: SPI_TypeDef::I2SCFGR"]
        [::core::mem::offset_of!(SPI_TypeDef, I2SCFGR) - 28usize];
    ["Offset of field: SPI_TypeDef::I2SPR"][::core::mem::offset_of!(SPI_TypeDef, I2SPR) - 32usize];
};
#[doc = " @brief TIM"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TIM_TypeDef {
    #[doc = "< TIM control register 1,                       Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< TIM control register 2,                       Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< TIM slave Mode Control register,              Address offset: 0x08"]
    pub SMCR: u32,
    #[doc = "< TIM DMA/interrupt enable register,            Address offset: 0x0C"]
    pub DIER: u32,
    #[doc = "< TIM status register,                          Address offset: 0x10"]
    pub SR: u32,
    #[doc = "< TIM event generation register,                Address offset: 0x14"]
    pub EGR: u32,
    #[doc = "< TIM  capture/compare mode register 1,         Address offset: 0x18"]
    pub CCMR1: u32,
    #[doc = "< TIM  capture/compare mode register 2,         Address offset: 0x1C"]
    pub CCMR2: u32,
    #[doc = "< TIM capture/compare enable register,          Address offset: 0x20"]
    pub CCER: u32,
    #[doc = "< TIM counter register,                         Address offset: 0x24"]
    pub CNT: u32,
    #[doc = "< TIM prescaler register,                       Address offset: 0x28"]
    pub PSC: u32,
    #[doc = "< TIM auto-reload register,                     Address offset: 0x2C"]
    pub ARR: u32,
    #[doc = "< Reserved                                      Address offset: 0x30"]
    pub RESERVED12: u32,
    #[doc = "< TIM capture/compare register 1,               Address offset: 0x34"]
    pub CCR1: u32,
    #[doc = "< TIM capture/compare register 2,               Address offset: 0x38"]
    pub CCR2: u32,
    #[doc = "< TIM capture/compare register 3,               Address offset: 0x3C"]
    pub CCR3: u32,
    #[doc = "< TIM capture/compare register 4,               Address offset: 0x40"]
    pub CCR4: u32,
    #[doc = "< Reserved,                                     Address offset: 0x44"]
    pub RESERVED17: u32,
    #[doc = "< TIM DMA control register,                     Address offset: 0x48"]
    pub DCR: u32,
    #[doc = "< TIM DMA address for full transfer register,   Address offset: 0x4C"]
    pub DMAR: u32,
    #[doc = "< TIM option register,                          Address offset: 0x50"]
    pub OR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIM_TypeDef"][::core::mem::size_of::<TIM_TypeDef>() - 84usize];
    ["Alignment of TIM_TypeDef"][::core::mem::align_of::<TIM_TypeDef>() - 4usize];
    ["Offset of field: TIM_TypeDef::CR1"][::core::mem::offset_of!(TIM_TypeDef, CR1) - 0usize];
    ["Offset of field: TIM_TypeDef::CR2"][::core::mem::offset_of!(TIM_TypeDef, CR2) - 4usize];
    ["Offset of field: TIM_TypeDef::SMCR"][::core::mem::offset_of!(TIM_TypeDef, SMCR) - 8usize];
    ["Offset of field: TIM_TypeDef::DIER"][::core::mem::offset_of!(TIM_TypeDef, DIER) - 12usize];
    ["Offset of field: TIM_TypeDef::SR"][::core::mem::offset_of!(TIM_TypeDef, SR) - 16usize];
    ["Offset of field: TIM_TypeDef::EGR"][::core::mem::offset_of!(TIM_TypeDef, EGR) - 20usize];
    ["Offset of field: TIM_TypeDef::CCMR1"][::core::mem::offset_of!(TIM_TypeDef, CCMR1) - 24usize];
    ["Offset of field: TIM_TypeDef::CCMR2"][::core::mem::offset_of!(TIM_TypeDef, CCMR2) - 28usize];
    ["Offset of field: TIM_TypeDef::CCER"][::core::mem::offset_of!(TIM_TypeDef, CCER) - 32usize];
    ["Offset of field: TIM_TypeDef::CNT"][::core::mem::offset_of!(TIM_TypeDef, CNT) - 36usize];
    ["Offset of field: TIM_TypeDef::PSC"][::core::mem::offset_of!(TIM_TypeDef, PSC) - 40usize];
    ["Offset of field: TIM_TypeDef::ARR"][::core::mem::offset_of!(TIM_TypeDef, ARR) - 44usize];
    ["Offset of field: TIM_TypeDef::RESERVED12"]
        [::core::mem::offset_of!(TIM_TypeDef, RESERVED12) - 48usize];
    ["Offset of field: TIM_TypeDef::CCR1"][::core::mem::offset_of!(TIM_TypeDef, CCR1) - 52usize];
    ["Offset of field: TIM_TypeDef::CCR2"][::core::mem::offset_of!(TIM_TypeDef, CCR2) - 56usize];
    ["Offset of field: TIM_TypeDef::CCR3"][::core::mem::offset_of!(TIM_TypeDef, CCR3) - 60usize];
    ["Offset of field: TIM_TypeDef::CCR4"][::core::mem::offset_of!(TIM_TypeDef, CCR4) - 64usize];
    ["Offset of field: TIM_TypeDef::RESERVED17"]
        [::core::mem::offset_of!(TIM_TypeDef, RESERVED17) - 68usize];
    ["Offset of field: TIM_TypeDef::DCR"][::core::mem::offset_of!(TIM_TypeDef, DCR) - 72usize];
    ["Offset of field: TIM_TypeDef::DMAR"][::core::mem::offset_of!(TIM_TypeDef, DMAR) - 76usize];
    ["Offset of field: TIM_TypeDef::OR"][::core::mem::offset_of!(TIM_TypeDef, OR) - 80usize];
};
#[doc = " @brief Touch Sensing Controller (TSC)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TSC_TypeDef {
    #[doc = "< TSC control register,                     Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< TSC interrupt enable register,            Address offset: 0x04"]
    pub IER: u32,
    #[doc = "< TSC interrupt clear register,             Address offset: 0x08"]
    pub ICR: u32,
    #[doc = "< TSC interrupt status register,            Address offset: 0x0C"]
    pub ISR: u32,
    #[doc = "< TSC I/O hysteresis control register,      Address offset: 0x10"]
    pub IOHCR: u32,
    #[doc = "< Reserved,                                 Address offset: 0x14"]
    pub RESERVED1: u32,
    #[doc = "< TSC I/O analog switch control register,   Address offset: 0x18"]
    pub IOASCR: u32,
    #[doc = "< Reserved,                                 Address offset: 0x1C"]
    pub RESERVED2: u32,
    #[doc = "< TSC I/O sampling control register,        Address offset: 0x20"]
    pub IOSCR: u32,
    #[doc = "< Reserved,                                 Address offset: 0x24"]
    pub RESERVED3: u32,
    #[doc = "< TSC I/O channel control register,         Address offset: 0x28"]
    pub IOCCR: u32,
    #[doc = "< Reserved,                                 Address offset: 0x2C"]
    pub RESERVED4: u32,
    #[doc = "< TSC I/O group control status register,    Address offset: 0x30"]
    pub IOGCSR: u32,
    #[doc = "< TSC I/O group x counter register,         Address offset: 0x34-50"]
    pub IOGXCR: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSC_TypeDef"][::core::mem::size_of::<TSC_TypeDef>() - 84usize];
    ["Alignment of TSC_TypeDef"][::core::mem::align_of::<TSC_TypeDef>() - 4usize];
    ["Offset of field: TSC_TypeDef::CR"][::core::mem::offset_of!(TSC_TypeDef, CR) - 0usize];
    ["Offset of field: TSC_TypeDef::IER"][::core::mem::offset_of!(TSC_TypeDef, IER) - 4usize];
    ["Offset of field: TSC_TypeDef::ICR"][::core::mem::offset_of!(TSC_TypeDef, ICR) - 8usize];
    ["Offset of field: TSC_TypeDef::ISR"][::core::mem::offset_of!(TSC_TypeDef, ISR) - 12usize];
    ["Offset of field: TSC_TypeDef::IOHCR"][::core::mem::offset_of!(TSC_TypeDef, IOHCR) - 16usize];
    ["Offset of field: TSC_TypeDef::RESERVED1"]
        [::core::mem::offset_of!(TSC_TypeDef, RESERVED1) - 20usize];
    ["Offset of field: TSC_TypeDef::IOASCR"]
        [::core::mem::offset_of!(TSC_TypeDef, IOASCR) - 24usize];
    ["Offset of field: TSC_TypeDef::RESERVED2"]
        [::core::mem::offset_of!(TSC_TypeDef, RESERVED2) - 28usize];
    ["Offset of field: TSC_TypeDef::IOSCR"][::core::mem::offset_of!(TSC_TypeDef, IOSCR) - 32usize];
    ["Offset of field: TSC_TypeDef::RESERVED3"]
        [::core::mem::offset_of!(TSC_TypeDef, RESERVED3) - 36usize];
    ["Offset of field: TSC_TypeDef::IOCCR"][::core::mem::offset_of!(TSC_TypeDef, IOCCR) - 40usize];
    ["Offset of field: TSC_TypeDef::RESERVED4"]
        [::core::mem::offset_of!(TSC_TypeDef, RESERVED4) - 44usize];
    ["Offset of field: TSC_TypeDef::IOGCSR"]
        [::core::mem::offset_of!(TSC_TypeDef, IOGCSR) - 48usize];
    ["Offset of field: TSC_TypeDef::IOGXCR"]
        [::core::mem::offset_of!(TSC_TypeDef, IOGXCR) - 52usize];
};
#[doc = " @brief Universal Synchronous Asynchronous Receiver Transmitter"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USART_TypeDef {
    #[doc = "< USART Control register 1,                 Address offset: 0x00"]
    pub CR1: u32,
    #[doc = "< USART Control register 2,                 Address offset: 0x04"]
    pub CR2: u32,
    #[doc = "< USART Control register 3,                 Address offset: 0x08"]
    pub CR3: u32,
    #[doc = "< USART Baud rate register,                 Address offset: 0x0C"]
    pub BRR: u32,
    #[doc = "< USART Guard time and prescaler register,  Address offset: 0x10"]
    pub GTPR: u32,
    #[doc = "< USART Receiver Time Out register,         Address offset: 0x14"]
    pub RTOR: u32,
    #[doc = "< USART Request register,                   Address offset: 0x18"]
    pub RQR: u32,
    #[doc = "< USART Interrupt and status register,      Address offset: 0x1C"]
    pub ISR: u32,
    #[doc = "< USART Interrupt flag Clear register,      Address offset: 0x20"]
    pub ICR: u32,
    #[doc = "< USART Receive Data register,              Address offset: 0x24"]
    pub RDR: u32,
    #[doc = "< USART Transmit Data register,             Address offset: 0x28"]
    pub TDR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of USART_TypeDef"][::core::mem::size_of::<USART_TypeDef>() - 44usize];
    ["Alignment of USART_TypeDef"][::core::mem::align_of::<USART_TypeDef>() - 4usize];
    ["Offset of field: USART_TypeDef::CR1"][::core::mem::offset_of!(USART_TypeDef, CR1) - 0usize];
    ["Offset of field: USART_TypeDef::CR2"][::core::mem::offset_of!(USART_TypeDef, CR2) - 4usize];
    ["Offset of field: USART_TypeDef::CR3"][::core::mem::offset_of!(USART_TypeDef, CR3) - 8usize];
    ["Offset of field: USART_TypeDef::BRR"][::core::mem::offset_of!(USART_TypeDef, BRR) - 12usize];
    ["Offset of field: USART_TypeDef::GTPR"]
        [::core::mem::offset_of!(USART_TypeDef, GTPR) - 16usize];
    ["Offset of field: USART_TypeDef::RTOR"]
        [::core::mem::offset_of!(USART_TypeDef, RTOR) - 20usize];
    ["Offset of field: USART_TypeDef::RQR"][::core::mem::offset_of!(USART_TypeDef, RQR) - 24usize];
    ["Offset of field: USART_TypeDef::ISR"][::core::mem::offset_of!(USART_TypeDef, ISR) - 28usize];
    ["Offset of field: USART_TypeDef::ICR"][::core::mem::offset_of!(USART_TypeDef, ICR) - 32usize];
    ["Offset of field: USART_TypeDef::RDR"][::core::mem::offset_of!(USART_TypeDef, RDR) - 36usize];
    ["Offset of field: USART_TypeDef::TDR"][::core::mem::offset_of!(USART_TypeDef, TDR) - 40usize];
};
#[doc = " @brief Window WATCHDOG"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct WWDG_TypeDef {
    #[doc = "< WWDG Control register,       Address offset: 0x00"]
    pub CR: u32,
    #[doc = "< WWDG Configuration register, Address offset: 0x04"]
    pub CFR: u32,
    #[doc = "< WWDG Status register,        Address offset: 0x08"]
    pub SR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WWDG_TypeDef"][::core::mem::size_of::<WWDG_TypeDef>() - 12usize];
    ["Alignment of WWDG_TypeDef"][::core::mem::align_of::<WWDG_TypeDef>() - 4usize];
    ["Offset of field: WWDG_TypeDef::CR"][::core::mem::offset_of!(WWDG_TypeDef, CR) - 0usize];
    ["Offset of field: WWDG_TypeDef::CFR"][::core::mem::offset_of!(WWDG_TypeDef, CFR) - 4usize];
    ["Offset of field: WWDG_TypeDef::SR"][::core::mem::offset_of!(WWDG_TypeDef, SR) - 8usize];
};
#[doc = " @brief Universal Serial Bus Full Speed Device"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct USB_TypeDef {
    #[doc = "< USB Endpoint 0 register,                Address offset: 0x00"]
    pub EP0R: u16,
    #[doc = "< Reserved"]
    pub RESERVED0: u16,
    #[doc = "< USB Endpoint 1 register,                Address offset: 0x04"]
    pub EP1R: u16,
    #[doc = "< Reserved"]
    pub RESERVED1: u16,
    #[doc = "< USB Endpoint 2 register,                Address offset: 0x08"]
    pub EP2R: u16,
    #[doc = "< Reserved"]
    pub RESERVED2: u16,
    #[doc = "< USB Endpoint 3 register,                Address offset: 0x0C"]
    pub EP3R: u16,
    #[doc = "< Reserved"]
    pub RESERVED3: u16,
    #[doc = "< USB Endpoint 4 register,                Address offset: 0x10"]
    pub EP4R: u16,
    #[doc = "< Reserved"]
    pub RESERVED4: u16,
    #[doc = "< USB Endpoint 5 register,                Address offset: 0x14"]
    pub EP5R: u16,
    #[doc = "< Reserved"]
    pub RESERVED5: u16,
    #[doc = "< USB Endpoint 6 register,                Address offset: 0x18"]
    pub EP6R: u16,
    #[doc = "< Reserved"]
    pub RESERVED6: u16,
    #[doc = "< USB Endpoint 7 register,                Address offset: 0x1C"]
    pub EP7R: u16,
    #[doc = "< Reserved"]
    pub RESERVED7: [u16; 17usize],
    #[doc = "< Control register,                       Address offset: 0x40"]
    pub CNTR: u16,
    #[doc = "< Reserved"]
    pub RESERVED8: u16,
    #[doc = "< Interrupt status register,              Address offset: 0x44"]
    pub ISTR: u16,
    #[doc = "< Reserved"]
    pub RESERVED9: u16,
    #[doc = "< Frame number register,                  Address offset: 0x48"]
    pub FNR: u16,
    #[doc = "< Reserved"]
    pub RESERVEDA: u16,
    #[doc = "< Device address register,                Address offset: 0x4C"]
    pub DADDR: u16,
    #[doc = "< Reserved"]
    pub RESERVEDB: u16,
    #[doc = "< Buffer Table address register,          Address offset: 0x50"]
    pub BTABLE: u16,
    #[doc = "< Reserved"]
    pub RESERVEDC: u16,
    #[doc = "< LPM Control and Status register,        Address offset: 0x54"]
    pub LPMCSR: u16,
    #[doc = "< Reserved"]
    pub RESERVEDD: u16,
    #[doc = "< Battery Charging detector register,     Address offset: 0x58"]
    pub BCDR: u16,
    #[doc = "< Reserved"]
    pub RESERVEDE: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of USB_TypeDef"][::core::mem::size_of::<USB_TypeDef>() - 92usize];
    ["Alignment of USB_TypeDef"][::core::mem::align_of::<USB_TypeDef>() - 2usize];
    ["Offset of field: USB_TypeDef::EP0R"][::core::mem::offset_of!(USB_TypeDef, EP0R) - 0usize];
    ["Offset of field: USB_TypeDef::RESERVED0"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED0) - 2usize];
    ["Offset of field: USB_TypeDef::EP1R"][::core::mem::offset_of!(USB_TypeDef, EP1R) - 4usize];
    ["Offset of field: USB_TypeDef::RESERVED1"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED1) - 6usize];
    ["Offset of field: USB_TypeDef::EP2R"][::core::mem::offset_of!(USB_TypeDef, EP2R) - 8usize];
    ["Offset of field: USB_TypeDef::RESERVED2"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED2) - 10usize];
    ["Offset of field: USB_TypeDef::EP3R"][::core::mem::offset_of!(USB_TypeDef, EP3R) - 12usize];
    ["Offset of field: USB_TypeDef::RESERVED3"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED3) - 14usize];
    ["Offset of field: USB_TypeDef::EP4R"][::core::mem::offset_of!(USB_TypeDef, EP4R) - 16usize];
    ["Offset of field: USB_TypeDef::RESERVED4"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED4) - 18usize];
    ["Offset of field: USB_TypeDef::EP5R"][::core::mem::offset_of!(USB_TypeDef, EP5R) - 20usize];
    ["Offset of field: USB_TypeDef::RESERVED5"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED5) - 22usize];
    ["Offset of field: USB_TypeDef::EP6R"][::core::mem::offset_of!(USB_TypeDef, EP6R) - 24usize];
    ["Offset of field: USB_TypeDef::RESERVED6"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED6) - 26usize];
    ["Offset of field: USB_TypeDef::EP7R"][::core::mem::offset_of!(USB_TypeDef, EP7R) - 28usize];
    ["Offset of field: USB_TypeDef::RESERVED7"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED7) - 30usize];
    ["Offset of field: USB_TypeDef::CNTR"][::core::mem::offset_of!(USB_TypeDef, CNTR) - 64usize];
    ["Offset of field: USB_TypeDef::RESERVED8"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED8) - 66usize];
    ["Offset of field: USB_TypeDef::ISTR"][::core::mem::offset_of!(USB_TypeDef, ISTR) - 68usize];
    ["Offset of field: USB_TypeDef::RESERVED9"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVED9) - 70usize];
    ["Offset of field: USB_TypeDef::FNR"][::core::mem::offset_of!(USB_TypeDef, FNR) - 72usize];
    ["Offset of field: USB_TypeDef::RESERVEDA"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVEDA) - 74usize];
    ["Offset of field: USB_TypeDef::DADDR"][::core::mem::offset_of!(USB_TypeDef, DADDR) - 76usize];
    ["Offset of field: USB_TypeDef::RESERVEDB"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVEDB) - 78usize];
    ["Offset of field: USB_TypeDef::BTABLE"]
        [::core::mem::offset_of!(USB_TypeDef, BTABLE) - 80usize];
    ["Offset of field: USB_TypeDef::RESERVEDC"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVEDC) - 82usize];
    ["Offset of field: USB_TypeDef::LPMCSR"]
        [::core::mem::offset_of!(USB_TypeDef, LPMCSR) - 84usize];
    ["Offset of field: USB_TypeDef::RESERVEDD"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVEDD) - 86usize];
    ["Offset of field: USB_TypeDef::BCDR"][::core::mem::offset_of!(USB_TypeDef, BCDR) - 88usize];
    ["Offset of field: USB_TypeDef::RESERVEDE"]
        [::core::mem::offset_of!(USB_TypeDef, RESERVEDE) - 90usize];
};
